# KNDashMPerDegree Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KNDashMPerDegree Property
SymbolTypeId Class See Also
---
Symbol kN-m/°, indicating unit Kilonewton meters per degree.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KNDashMPerDegree { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KNDashMPerDegree As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KNDashMPerDegree {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace